try:
	from googletrans import Translator
	translator = Translator(service_urls=['translate.googleapis.com'])
	# translator = Translator(service_urls=['translate.googleapis.com'])
	# translator = Translator()
	text_str = '''
	కోర్ బ్రాంచ్‌ల్లో కలిసొచ్చే సర్టిఫికేషన్స్...
	టెక్నికల్ ఎడ్యుకేషన్ సర్టిఫికేషన్ కోర్సులంటే ఎక్కువ మంది ఐటీ,
	కంప్యూటర్ సైన్స్ కోర్సులకుసంబంధించినవేనని భావిస్తారు. ఐటీ/సాఫ్ట్‌వేర్ రంగాలకు
	పెరుగుతున్న ప్రాధాన్యం, అవసరాలే దీనికి కారణం. అయితే కోర్ బ్రాంచ్‌లుగా పేరొందిన
	విభాగాల్లోనూ ఇప్పుడు జాబ్ ఓరియెంటెడ్ సర్టిఫికెట్ కోర్సులు అందుబాటులోకి వస్తున్నాయి.
	ముఖ్యంగా సివిల్, మెకానికల్ బ్రాంచ్‌ల విద్యార్థులకు జాబ్ మార్కెట్లో అవకాశాలు
	అందించేందుకు ఈ సర్టిఫికేషన్స్ దోహదపడుతున్నాయి. ఈ క్రమంలో సివిల్,
	మెకానికల్ ఇంజనీరింగ్ విభాగాల్లో ప్రాచుర్యం పొందిన సర్టిఫికెట్ కోర్సుల వివరాలు.
	సంప్రదాయ ఇంజనీరింగ్ బ్రాంచ్‌లుగా, క్షేత్రస్థాయి విధులకు అధిక ప్రాధాన్యం
	ఉండే బ్రాంచ్‌లుగా సివిల్ ఇంజనీరింగ్, మెకానికల్ ఇంజనీరింగ్ గుర్తింపు సాధించాయి. కానీ
	టెక్నాలజీ ఆవిష్కరణలతో ఈ రంగాలు ఇప్పుడు ఆధునికతను సంతరించుకుంటున్నాయి. ఈ
	క్రమంలోనే కొత్త నైపుణ్యాల సముపార్జన అవసరమైంది. ఉదాహరణకు గతంలో ఒక నిర్మాణానికి
	సంబంధించి డిజైన్ రూపొందించాలంటే.. సివిల్ ఇంజనీర్ సదరు ప్రదేశాన్ని ప్రత్యక్షంగా పరిశీలించి,
	డ్రాయింగ్, డిజైన్ కార్యకలాపాలు నిర్వహించేవారు. కానీ ఇప్పుడు ట్రెండ్ మారింది.
	కంప్యూటర్ ముందు కూర్చుని, నిర్దిష్ట ప్రమాణాల మేరకు ఆటోమేషన్ విధానంలో డిజైన్,
	డ్రాయింగ్ రూపొందిస్తున్నారు. ఇదే విధంగా మెకానికల్ ఇంజనీరింగ్‌లోనూ ఉత్పత్తి రూపకల్పన,
	పర్యవేక్షణకు సంబంధించి ఆధునిక పద్ధతులు అందుబాటులోకి వచ్చాయి. వీటికి సంబంధించి
	ప్రత్యేక కోర్సులు కూడా ఆవిష్కృతమవుతున్నాయి.'''
	result = translator.translate(text_str, src = 'te', dest ='en')
	print(result)

except Exception as e:
	print(e)